In [1]:
import pandas as pd

In [2]:
#1) Create a DF
people = pd.DataFrame({
    'Age' : [15,19,35,11],
    'Shoe Size' : [9,11,7,5],
    'Eye Colour' : ['Blue','Brown','Blue','Green'],
    'Height (cm)' : [182,167,130,156]},
                      index = ['Josh','Tim','Sarah','Cindy'])
people

       Age  Shoe Size Eye Colour  Height (cm)
Josh    15          9       Blue          182
Tim     19         11      Brown          167
Sarah   35          7       Blue          130
Cindy   11          5      Green          156

In [8]:
#2) Total Cumulative Age
sum = people['Age'].sum()
sum

80

In [9]:
#3) Mean Age
mean_age = people['Age'].mean()
mean_age

20.0

In [10]:
#4) Average Height
mean_height = people['Height (cm)'].mean()
mean_height

158.75

In [11]:
#5) Create a new DF
more_on_people = pd.DataFrame({
    'Wingspan' : [190,164,135,160],
    'Hair Colour' : ['Brown','Blonde','Brown','Red']},
                             index = ['Josh','Tim','Sarah','Cindy'])
more_on_people

       Wingspan Hair Colour
Josh        190       Brown
Tim         164      Blonde
Sarah       135       Brown
Cindy       160         Red

In [7]:
#6) Merge two DFs
pd.concat([people, more_on_people], axis = 1, sort = False)

       Age  Shoe Size Eye Colour  Height (cm)  Wingspan Hair Colour
Josh    15          9       Blue          182       190       Brown
Tim     19         11      Brown          167       164      Blonde
Sarah   35          7       Blue          130       135       Brown
Cindy   11          5      Green          156       160         Red